# StructuralSectionRound Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
StructuralSectionRound Class
Members See Also
---
Defines common set of parameters for structural section round contour.
**Namespace:** Autodesk.Revit.DB.Structure.StructuralSections**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public class StructuralSectionRound : StructuralSection
```

Visual Basic
---
```text
Public Class StructuralSectionRound _
	Inherits StructuralSection
```

Visual C++
---
```text
public ref class StructuralSectionRound : public StructuralSection
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.Structure.StructuralSections..::..StructuralSection Autodesk.Revit.DB.Structure.StructuralSections..::..StructuralSectionRound Autodesk.Revit.DB.Structure.StructuralSections..::..StructuralSectionConcreteRound Autodesk.Revit.DB.Structure.StructuralSections..::..StructuralSectionGeneralR Autodesk.Revit.DB.Structure.StructuralSections..::..StructuralSectionGeneralS
# See Also
StructuralSectionRound Members
Autodesk.Revit.DB.Structure.StructuralSections Namespace